//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ПровожуЭтотДокумент()","ПровожуЭтотДокумент","и провожу этот документ");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьБумажныйДомументПоступления()","УМеняЕстьБумажныйДомументПоступления","Допустим у меня есть бумажный домумент поступления");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЗаполняюВ1сДокументПоступлениеТоваровИУслуг()","ЗаполняюВ1сДокументПоступлениеТоваровИУслуг","Когда заполняю в 1с документ Поступление товаров и услуг");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЕслиОшибокНетВПроведенииПоявляетсяСообщение(Парам01)","ЕслиОшибокНетВПроведенииПоявляетсяСообщение","Тогда если ошибок нет в проведении появляется сообщение ""Поступление успешно проведено""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЗаполнилДокумент()","ЗаполнилДокумент","Допустим заполнил документ");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ПровестиДокумент()","ПровестиДокумент","Когда провести документ");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВывестиСообщение()","ВывестиСообщение","Тогда вывести сообщение");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим у меня есть бумажный домумент поступления
//@УМеняЕстьБумажныйДомументПоступления()
Процедура УМеняЕстьБумажныйДомументПоступления() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда заполняю в 1с документ Поступление товаров и услуг
//@ЗаполняюВ1сДокументПоступлениеТоваровИУслуг()
Процедура ЗаполняюВ1сДокументПоступлениеТоваровИУслуг() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//и провожу этот документ
//@ПровожуЭтотДокумент()
Процедура ПровожуЭтотДокумент() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда если ошибок нет в проведении появляется сообщение "Поступление успешно проведено"
//@ЕслиОшибокНетВПроведенииПоявляетсяСообщение(Парам01)
Процедура ЕслиОшибокНетВПроведенииПоявляетсяСообщение(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//окончание текста модуля

&НаКлиенте
//Допустим заполнил документ
//@ЗаполнилДокумент()
Процедура ЗаполнилДокумент() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда провести документ
//@ПровестиДокумент()
Процедура ПровестиДокумент() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда вывести сообщение
//@ВывестиСообщение()
Процедура ВывестиСообщение() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры
