//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"СоздадимДокументРеализацииНаТонныЛатины(Парам01)","СоздадимДокументРеализацииНаТонныЛатины","Допустим создадим документ Реализации на 2 тонны латины");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ПроводитьсяПроверкаНаличияТребуемогоКоличества()","ПроводитьсяПроверкаНаличияТребуемогоКоличества","и проводиться проверка наличия требуемого количества");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НужногоКоличестваНет()","НужногоКоличестваНет","Если нужного количества нет");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДокументНеПроводиться()","ДокументНеПроводиться","Тогда документ не проводиться");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим создадим документ Реализации на 2 тонны латины
//@СоздадимДокументРеализацииНаТонныЛатины(Парам01)
Процедура СоздадимДокументРеализацииНаТонныЛатины(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//и проводиться проверка наличия требуемого количества
//@ПроводитьсяПроверкаНаличияТребуемогоКоличества()
Процедура ПроводитьсяПроверкаНаличияТребуемогоКоличества() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Если нужного количества нет
//@НужногоКоличестваНет()
Процедура НужногоКоличестваНет() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда документ не проводиться
//@ДокументНеПроводиться()
Процедура ДокументНеПроводиться() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//окончание текста модуля